# Cleaning UK est data

In [1]:
import numpy as np
import pandas as pd

In [7]:
est_file = 'data/estates/uk.csv'
df = pd.read_csv(est_file, sep='\t')
df.head()

      Date House Price (Adjusted Inflation)
0  1975 Q1                          ?92,841
1  1975 Q2                          ?87,658
2  1975 Q3                          ?85,885
3  1975 Q4                          ?85,408
4  1976 Q1                          ?83,933

In [8]:
df.columns = ['date', 'price']

In [15]:
df.date = pd.to_datetime(df.date.str.replace(' ', '')) + pd.offsets.QuarterEnd()
df = df.set_index('date')

In [16]:
df.head()

              price
date
1975-03-31  ?92,841
1975-06-30  ?87,658
1975-09-30  ?85,885
1975-12-31  ?85,408
1976-03-31  ?83,933

In [17]:
# clean price '?'
df.price = df.price.str.replace('?', '')
df.price = df.price.str.replace(',', '')
df.head()

            price
date
1975-03-31  92841
1975-06-30  87658
1975-09-30  85885
1975-12-31  85408
1976-03-31  83933

In [19]:
df.price = df.price.astype(int)

In [20]:
df.head()

            price
date
1975-03-31  92841
1975-06-30  87658
1975-09-30  85885
1975-12-31  85408
1976-03-31  83933

In [21]:
df.to_csv('uk.csv')